In [9]:
import pandas as pd
from pathlib import Path
import numpy as np
import datetime as dt


%matplotlib inline

In [108]:
#reading csv portfolio files
whale_df= pd.read_csv(r'C:\Users\Yvonne Colangelo\Downloads\whale_returns.csv', index_col = "Date",infer_datetime_format=True) 
algo_df = pd.read_csv(r'C:\Users\Yvonne Colangelo\Downloads\algo_returns.csv', index_col= "Date",infer_datetime_format=True)
tsx60_df = pd.read_csv(r'C:\Users\Yvonne Colangelo\Downloads\sp_tsx_history.csv', index_col = "Date",infer_datetime_format=True)

#adding the path to a text file where I am going to display my results
result_data = Path("C:/Users/Yvonne Colangelo/Portfolio/Portfolio-Analysis/Data_analysis_results.txt") 
    
with open(result_data, "w") as result_file:
    # Writing heading to my text file
    result_file.write(f"A Whale Off Port(folio)\n\n")
    head_result = whale_df.head()
    result_file.write(f"Reading the first five items in the dataframe \n\n")
    #writing the return to a text file
    result_file.write(f"{head_result.to_string()}\n\n")

    #Counting the nulls in the whales return data and writing them to the result text file
    result_file.write(f"Null Counts in the Dataframe\n\n")
    null_count = whale_df.isnull().count()
    result_file.write(f"{null_count.to_string()}\n\n")
    result_file.write("\n\n")
    
    #dropping the nulls in the whales dataframe
    result_file.write(f"Dropping Nulls in the Dataframe\n\n")
    dropping_nulls = whale_df.dropna(inplace = False)
    
    result_file.write(f"{dropping_nulls.head().to_string()}\n\n")
    
    #reading Algorithmic daily return
    
    result_file.write("Reading first five iteams in the Algorithmic Daily Returns Dataframe \n\n")
    result_file.write(f"{algo_df.head().to_string()}\n\n")
    
    #counting the nulls in the algorithmic dataframe
    result_file.write("Counting the Nulls in the Algorithmic Dataframe\n\n")
    result_file.write(f"{algo_df.isnull().count().to_string()}\n\n")
    
    #dropping the nulls in the algorithmic dataframe
    result_file.write("Dropping the Null values in the Algorithmic Dataframe\n\n")
    algo_null_drop = algo_df.dropna(inplace=False)
    result_file.write(f"{algo_null_drop.head().to_string()}\n\n")
    
    #Reading s&p TSX 60 closing price and listing the first five items
    result_file.write("First five iteams of the S&P TSX 60 closing prices Dataframs\n\n")
    result_file.write(f"{tsx60_df.head().to_string()}\n\n")
    
    #checking for datatype
    result_file.write("Reading data types of the S&P TSX 60 \n\n")
    result_file.write(f"{tsx60_df.dtypes.to_string()}\n\n")

In [81]:
#counting the nulls in the whale returns report
    
whale_df.isnull().count()

SOROS FUND MANAGEMENT LLC      1060
PAULSON & CO.INC.              1060
TIGER GLOBAL MANAGEMENT LLC    1060
BERKSHIRE HATHAWAY INC         1060
dtype: int64

In [82]:
#droping the nulls in the whales return report to clean
whale_df.dropna(inplace = True)
whale_df

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
2015-03-09,0.000582,0.004225,0.005843,-0.001652
...,...,...,...,...
2019-04-25,-0.000285,-0.001291,-0.005153,0.004848
2019-04-26,0.008149,0.009162,0.012355,0.010434
2019-04-29,0.001254,0.002719,0.006251,0.005223
2019-04-30,-0.001295,-0.002211,-0.000259,-0.003702
2019-05-01,-0.005847,-0.001341,-0.007936,-0.007833

In [87]:
#reading the algorithmic return
#algo_df = pd.read_csv(r'C:\Users\Yvonne Colangelo\Downloads\algo_returns.csv')
algo_df.head()

              Algo 1  Algo 2
Date
2014-05-28  0.001745     NaN
2014-05-29  0.003978     NaN
2014-05-30  0.004464     NaN
2014-06-02  0.005692     NaN
2014-06-03  0.005292     NaN

In [9]:
algo_df.isnull().count()

Date      1241
Algo 1    1241
Algo 2    1241
dtype: int64

In [88]:
algo_df.dropna(inplace = True)
algo_df

              Algo 1    Algo 2
Date
2014-06-05  0.004062  0.013285
2014-06-06  0.001857  0.008284
2014-06-09 -0.005012  0.005668
2014-06-10  0.004406 -0.000735
2014-06-11  0.004760 -0.003761
...              ...       ...
2019-04-25  0.000682 -0.007247
2019-04-26  0.002981  0.005256
2019-04-29  0.005208  0.002829
2019-04-30 -0.002944 -0.001570
2019-05-01  0.000094 -0.007358

[1235 rows x 2 columns]

In [109]:
#reading the S&P TSX 60 historic closing price
#tsx60_df = pd.read_csv(r'C:\Users\Yvonne Colangelo\Downloads\sp_tsx_history.csv')
tsx60_df.head()

                 Close
Date
1-Oct-2012  $12,370.19
2-Oct-2012  $12,391.23
3-Oct-2012  $12,359.47
4-Oct-2012  $12,447.68
5-Oct-2012  $12,418.99

In [98]:
#checking for the datatype
tsx60_df.dtypes

Close    object
dtype: object

In [115]:
#removing the dollar sign to fix data types
tsx60_df["Close"] = tsx60_df["Close"].str.replace("$" , "")
tsx60_df["Close"] = tsx60_df["Close"].str.replace("," , "")
tsx60_df["Close"] =tsx60_df["Close"].str.replace("." , "")
tsx60_df["Close"]

C:\Users\Yvonne Colangelo\AppData\Local\Temp\ipykernel_5512\873099717.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  tsx60_df["Close"] = tsx60_df["Close"].str.replace("$" , "")
C:\Users\Yvonne Colangelo\AppData\Local\Temp\ipykernel_5512\873099717.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  tsx60_df["Close"] =tsx60_df["Close"].str.replace("." , "")

Date
1-Oct-2012     1237019
2-Oct-2012     1239123
3-Oct-2012     1235947
4-Oct-2012     1244768
5-Oct-2012     1241899
                ...
20-Dec-2019    1711844
23-Dec-2019    1712871
24-Dec-2019    1718015
27-Dec-2019    1716821
30-Dec-2019    1709856
Name: Close, Length: 1818, dtype: object

In [116]:
#fixing the data types
#csv_data["order_total"] = csv_data["order_total"].astype("float")
tsx60_df["Close"] = tsx60_df["Close"].astype("int")

In [120]:
tsx60_df["Close"].dtypes

dtype('int32')

In [122]:
#calculating daily returns for S&P TSX 60
daily_return=tsx60_df.pct_change()
daily_return.head()

               Close
Date
1-Oct-2012       NaN
2-Oct-2012  0.001701
3-Oct-2012 -0.002563
4-Oct-2012  0.007137
5-Oct-2012 -0.002305

In [130]:
daily_return.dropna()

                Close
Date
2-Oct-2012   0.001701
3-Oct-2012  -0.002563
4-Oct-2012   0.007137
5-Oct-2012  -0.002305
9-Oct-2012  -0.011709
...               ...
20-Dec-2019  0.003188
23-Dec-2019  0.000600
24-Dec-2019  0.003003
27-Dec-2019 -0.000695
30-Dec-2019 -0.004057

[1817 rows x 1 columns]

In [136]:
tsx60_daily_return = daily_return.rename(columns={"Close": "Daily Return"})
tsx60_daily_return.head()

            Daily Return
Date
1-Oct-2012           NaN
2-Oct-2012      0.001701
3-Oct-2012     -0.002563
4-Oct-2012      0.007137
5-Oct-2012     -0.002305